Rhino.Inside.Revit API
GeometryEncoder.ToBoundingBoxXYZ Method (BoundingBox)
 Converts the specified Rhino.Geometry.BoundingBox to an equivalent Autodesk.Revit.DB.BoundingBoxXYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.BoundingBoxXYZ ToBoundingBoxXYZ(
	this Rhino.Geometry.BoundingBox boundingBox
)
@staticmethod
def ToBoundingBoxXYZ(
	boundingBox: Rhino.Geometry.BoundingBox
) -> Autodesk.Revit.DB.BoundingBoxXYZ
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
Rhino bounding box to convert.
Return Value
Type: Autodesk.Revit.DB.BoundingBoxXYZ
Revit bounding box that is equivalent to the provided Rhino bounding box.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.BoundingBox. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBoundingBoxXYZ(BoundingBox) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.BoundingBoxXYZ revitBBox = rhinoBBox.ToBoundingBoxXYZ();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_bbox = rhino_bbox.ToBoundingBoxXYZ()    # type: DB.BoundingBoxXYZ
 Using ToBoundingBoxXYZ(BoundingBox) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.BoundingBoxXYZ revitBBox = GeometryEncoder.ToBoundingBoxXYZ(rhinoBBox);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_bbox = GE.ToBoundingBoxXYZ(rhino_bbox)    # type: DB.BoundingBoxXYZ
See Also
Reference
GeometryEncoder Class
ToBoundingBoxXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace